#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ПодключаемыеОтчетыИОбработки

// (См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииСоставаНастроекПодключаемыхОбъектов)
Процедура ПриОпределенииНастроек(Настройки) Экспорт
	
	Настройки.НастроитьВариантыОтчета = Истина;
	Настройки.ДобавитьКомандыОтчетов = Истина;
	Настройки.ОпределитьНастройкиФормы = Истина;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеОтчетыИОбработки

// СтандартныеПодсистемы.ВариантыОтчетов

// (См. ВариантыОтчетовПереопределяемый.ОпределитьОбъектыСКомандамиОтчетов)
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	Команда = КомандыОтчетов.Добавить();
	Команда.Представление = НСтр("ru = 'Монитор операций закрытия месяца'");
	Команда.КлючВарианта  = "Основной";
	
КонецПроцедуры

// (См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов)
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	НастройкиОтчета.Размещение.Вставить(Метаданные.Подсистемы.ФинансовыйРезультатИКонтроллинг);
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Основной");
	НастройкиВарианта.Описание = 
		НСтр("ru = 'Контроль операций закрытия месяца по разным этапам с начала ведения учета в программе.
		           |Позволяет найти проблемный месяц и проблемный этап закрытия и перейти к закрытию месяца.'");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#КонецЕсли